using System;
namespace Seminar2
{
    class Program
    {
        static void Main(string[] args)
        
        // Задача 10. Напишите программу, которая принимает на вход трехзначное число и на выходе
        // показывает вторую цифру этого числа.
        //{
            //SecondNumber();
        //}
        //static void SecondNumber()
        
        //{
            //Console.Write("Введите трехзначное число: ");
            //int number = Convert.ToInt32(Console.ReadLine());
            
            //int number1 = number / 10;
            //int number2 = number1 % 10;
            
            //Console.WriteLine($"Вторая цифра числа {number} = {number2} ");
        //}
        
        // Задача 13. Напишите программу, которая выводит третью цифру заданного числа или сообщает, 
        // что третьей цифры нет.

        //{
            //ThirdNumber();
        //}

        //static void ThirdNumber()
        //{
            //Console.Write("Введите число: ");
            //int number = Convert.ToInt32(Console.ReadLine());
            
            //if(number > 99)
            //{
                //int length = (int)Math.Log10(number);
                //int numberPow = (int)Math.Pow(10, length - 2);
                //int number3 = number / numberPow % 10;
                    
                //Console.WriteLine($"Третья цифра числа {number} = {number3} ");
            //}
            //else
            //{
                //Console.WriteLine($"Третьей цифры у числа {number} нет");
            //}
        //}              
        // Задача 15. Напишите программу, которая принимает на вход цифру, обозначающую
        // день недели, и проверяет, является ли этот день выходным.
           
        //{
            //Weekday(); 
        //}

        //static void Weekday()
        //{
            //Console.Write("Введите число дня недели от 1 до 7: ");
            //int number = Convert.ToInt32(Console.ReadLine());
            
                        
            //if(number>7)
            //{
                //Console.WriteLine("Bad number");
            //}
            //else
            //{
                //if(number<6)
                //{
                    //Console.WriteLine("нет");
                //}
                //else
                //{
                    //Console.WriteLine("да");
                //}
            //}
        //}
        // Задача. Напишите программу, которая принимает на вход число и проверяет, 
        // кратно ли оно одновременно 7 и 23.
        //{
            //DivNumber();
        //}
        //static void DivNumber()
        //{
            //Console.Write("Введите число: ");
            //int number = Convert.ToInt32(Console.ReadLine());
            
                        
            //if(number % 7 == 0 && number % 23 == 0)
            //{
                //Console.WriteLine("да");
            //}
            //else
            //{
                //Console.WriteLine("нет");
            //}
            
        //}
         
    }    
}